export const planets = [
  {
    image: 'sun',
    images: ['main-256px.png', 'sun1.png', 'sun2.jpg'],
    name: 'Солнце',
    text: `Со́лнце (астр. ☉) — одна из звёзд нашей Галактики (Млечный Путь) и единственная звезда Солнечной системы. Вокруг Солнца обращаются другие объекты этой системы: планеты и их спутники, карликовые планеты и их спутники, астероиды, метеороиды, кометы и космическая пыль.\n\nПо спектральной классификации Солнце относится к типу G2V (жёлтый карлик). Средняя плотность Солнца составляет 1,4 г/см³ (в 1,4 раза больше, чем у воды). Эффективная температура поверхности Солнца — 5780 кельвин[4]. Поэтому Солнце светит почти белым светом, но прямой свет Солнца у поверхности нашей планеты приобретает некоторый жёлтый оттенок из-за более сильного рассеяния и поглощения коротковолновой части спектра атмосферой Земли (при ясном небе, вместе с голубым рассеянным светом от неба, солнечный свет вновь даёт белое освещение).\n\nСолнечное излучение поддерживает жизнь на Земле (свет необходим для начальных стадий фотосинтеза или световой фазы), определяет климат. Светимость Солнца (суммарное количество энергии, выделяемое Солнцем за одну секунду) L⊙ = 3,827⋅1026 Вт.\n\nСолнце состоит из водорода (массовое содержание водорода X ≈ 73 %), гелия (массовое содержание Y ≈ 25 %[8]) и других элементов с меньшей концентрацией (ниже все элементы тяжелее гелия в этом контексте называются металлами, как принято в астрофизике); их общее массовое содержание Z ≈ 2 %[8]. Наиболее распространёнными элементами тяжелее водорода и гелия, в порядке убывания содержания, являются кислород, углерод, неон, азот, железо, магний, кремний, сера, аргон, алюминий, никель, натрий и кальций. На 1 млн атомов водорода приходится 98 000 атомов гелия, 851 атом кислорода, 398 атомов углерода, 123 атома неона, 100 атомов азота, 47 атомов железа, 38 атомов магния, 35 атомов кремния, 16 атомов серы, 4 атома аргона, 3 атома алюминия, по 2 атома никеля, натрия и кальция, а также малое количество прочих элементов[9].\n\nМасса Солнца M⊙ = (1,98847 ± 0,00007)⋅1030 кг[10], она составляет 99,866 % от суммарной массы всей Солнечной системы[4].\n\nСолнечный спектр содержит линии ионизированных и нейтральных металлов, а также водорода и гелия. В нашей Галактике (Млечный Путь) насчитывается от 200 до 400 миллиардов звёзд[11][12]. При этом 85 % звёзд нашей галактики — это звёзды, менее яркие, чем Солнце (в большинстве своём красные карлики). Как и все звёзды главной последовательности, Солнце вырабатывает энергию путём термоядерного синтеза гелия из водорода. В случае Солнца более 99 % энергии выделяется через протон-протонный цикл, тогда как для более массивных звёзд главной последовательности преимущественным путём синтеза гелия является CNO-цикл.\n\nСолнце — ближайшая к Земле звезда. Средняя удалённость Солнца от Земли — 149,6 млн км[1] — приблизительно равна астрономической единице, а видимый угловой диаметр при наблюдении с Земли, как и у Луны, — чуть больше полуградуса (31—32 минуты). Солнце находится на расстоянии около 26 000 световых лет от центра Млечного Пути и вращается вокруг него на ящичной орбите, делая один оборот за 225—250 миллионов лет[13]. Орбитальная скорость Солнца равна 217 км/с — таким образом, световой год оно проходит примерно за 1400 земных лет, а одну астрономическую единицу — за 8 земных суток[14].\n\nВ настоящее время Солнце находится во внутреннем крае рукава Ориона нашей Галактики, между рукавом Персея и рукавом Стрельца, и движется через Местное межзвёздное облако — область повышенной плотности, расположенную в имеющем меньшую плотность Местном пузыре — зоне рассеянного межзвёздного газа. Из звёзд, принадлежащих 50 самым близким звёздным системам в пределах 17 световых лет, известным в настоящее время, Солнце является четвёртой по яркости звездой (его абсолютная звёздная величина +4,83m).`,
    options: {
      weight: '1,9885⋅10^30 кг',
      radius: '696.000 км',
      averageTemp: '1.500.000 К',
    },
  },
  {
    image: 'mercury',
    name: 'Меркурий',
    text: 'some text',
    options: {
      rotationTime: 0.99,
      revolutionTime: 365,
      radius: 6.375,
      averageTemp: 16,
    },
  },
  {
    image: 'venus',
    name: 'Венера',
    text: 'some text',
    options: {
      rotationTime: 0.99,
      revolutionTime: 365,
      radius: 6.375,
      averageTemp: 16,
    },
  },
  {
    image: 'earth',
    name: 'Земля',
    text: 'some text',
    options: {
      rotationTime: 0.99,
      revolutionTime: 365,
      radius: 6.375,
      averageTemp: 16,
    },
  },
  {
    image: 'mars',
    name: 'Марс',
    text: 'some text',
    options: {
      rotationTime: 0.99,
      revolutionTime: 365,
      radius: 6.375,
      averageTemp: 16,
    },
  },
  {
    image: 'jupiter',
    name: 'Юпитер',
    text: 'some text',
    options: {
      rotationTime: 0.99,
      revolutionTime: 365,
      radius: 6.375,
      averageTemp: 16,
    },
  },
  {
    image: 'saturn',
    name: 'Сатурн',
    text: 'some text',
    options: {
      rotationTime: 0.99,
      revolutionTime: 365,
      radius: 6.375,
      averageTemp: 16,
    },
  },
  {
    image: 'uranus',
    name: 'Уран',
    text: 'some text',
    options: {
      rotationTime: 0.99,
      revolutionTime: 365,
      radius: 6.375,
      averageTemp: 16,
    },
  },
  {
    image: 'neptune',
    name: 'Нептун',
    text: 'some text',
    options: {
      rotationTime: 0.99,
      revolutionTime: 365,
      radius: 6.375,
      averageTemp: 16,
    },
  },
]
